# Progetto

## 1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframes

In [312]:
import pandas as pd
import re
import numpy as np

In [313]:
times = pd.read_csv("/home/vito/Scrivania/Unimib_Texbooks/Foundations_of_Computer_Science/Progetto/2020/timesData.csv", engine='python', na_values = '-')
times.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,NaN,94.2,"7,929",8.4,27%,45 : 55,2011

In [357]:
most_recent = times[times['year'] >= times['year'].max()].copy()
most_recent.tail()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2598,601-800,Yeungnam University,South Korea,18.6,24.3,10.9,26.5,35.4,NaN,"21,958",15.3,3%,48 : 52,2016
2599,601-800,Yıldız Technical University,Turkey,14.5,14.9,7.6,19.3,44.0,NaN,"31,268",28.7,2%,36 : 64,2016
2600,601-800,Yokohama City University,Japan,24.0,16.1,10.2,36.4,37.9,NaN,"4,122",3.7,3%,NaN,2016
2601,601-800,Yokohama National University,Japan,20.1,23.3,16.0,13.5,40.4,NaN,"10,117",12.1,8%,28 : 72,2016
2602,601-800,Yuan Ze University,Taiwan,16.2,17.7,18.3,28.6,39.8,NaN,"8,663",20.6,4%,43 : 57,2016

In [315]:
least_recent = times[times['year'] <= times['year'].min()]
least_recent

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,NaN,94.2,"7,929",8.4,27%,45 : 55,2011
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,196,Kent State University,United States of America,33.5,15.9,33.3,76.8,26.3,46.5,"23,122",19.0,8%,58 : 42,2011
196,197,University of Illinois at Chicago,United States of America,57.8,51.8,46.8,34.7,NaN,46.4,"24,313",9.2,17%,53 : 47,2011
197,197,Zhejiang University,China,54.6,29.6,41.3,44.3,70.3,46.4,"47,508",15.9,5%,41 : 59,2011
198,199,Simon Fraser University,Canada,32.9,51.9,44.2,60.2,37.9,46.2,"26,640",28.3,19%,55 : 45,2011
199,199,Swedish University of Agricultural Sciences,Sweden,43.3,NaN,49.5,41.7,99.9,46.2,"3,879",4.6,NaN,67 : 33,2011

In [316]:
least_recent['year'].unique()

array([2011])

## 2. For each university, compute the improvement in income between the least recent and the most recent data points

In [317]:
uniti = pd.merge(most_recent, least_recent, on = 'university_name')
uniti.head()

,world_rank_x,university_name,country_x,teaching_x,international_x,research_x,citations_x,income_x,total_score_x,num_students_x,...,international_y,research_y,citations_y,income_y,total_score_y,num_students_y,student_staff_ratio_y,international_students_y,female_male_ratio_y,year_y
0,1,California Institute of Technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,"2,243",...,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
1,2,University of Oxford,United Kingdom,86.5,94.4,98.9,98.8,73.1,94.2,"19,919",...,77.2,93.9,95.1,73.5,91.2,"19,919",11.6,34%,46 : 54,2011
2,3,Stanford University,United States of America,92.5,76.3,96.2,99.9,63.3,93.9,"15,596",...,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
3,4,University of Cambridge,United Kingdom,88.2,91.5,96.7,97.0,55.0,92.8,"18,812",...,77.7,94.1,94.0,57.0,91.2,"18,812",11.8,34%,46 : 54,2011
4,5,Massachusetts Institute of Technology,United States of America,89.4,84.0,88.6,99.7,95.4,92.0,"11,074",...,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011

In [318]:
uniti['improvement'] = pd.to_numeric(uniti['income_x']) - pd.to_numeric(uniti['income_y'])
uniti.head()

,world_rank_x,university_name,country_x,teaching_x,international_x,research_x,citations_x,income_x,total_score_x,num_students_x,...,research_y,citations_y,income_y,total_score_y,num_students_y,student_staff_ratio_y,international_students_y,female_male_ratio_y,year_y,improvement
0,1,California Institute of Technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,"2,243",...,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011,14.1
1,2,University of Oxford,United Kingdom,86.5,94.4,98.9,98.8,73.1,94.2,"19,919",...,93.9,95.1,73.5,91.2,"19,919",11.6,34%,46 : 54,2011,-0.4
2,3,Stanford University,United States of America,92.5,76.3,96.2,99.9,63.3,93.9,"15,596",...,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011,-1.0
3,4,University of Cambridge,United Kingdom,88.2,91.5,96.7,97.0,55.0,92.8,"18,812",...,94.1,94.0,57.0,91.2,"18,812",11.8,34%,46 : 54,2011,-2.0
4,5,Massachusetts Institute of Technology,United States of America,89.4,84.0,88.6,99.7,95.4,92.0,"11,074",...,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011,7.9

## 3. Find the university with the largest increase computed in the previous point

In [319]:
uniti[uniti['improvement'] >= uniti['improvement'].max()][['university_name','improvement']]

                     university_name  improvement
52  Nanyang Technological University         59.9

## 4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range

In [320]:
shanghai = pd.read_csv("/home/vito/Scrivania/Unimib_Texbooks/Foundations_of_Computer_Science/Progetto/2020/shanghaiData.csv", engine='python', na_values = '-')
shanghai.tail()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
4892,401-500,University of Trieste,11-20,NaN,0.0,0.0,5.0,10.9,25.1,20.1,2015
4893,401-500,University of Zaragoza,9-13,NaN,0.0,0.0,7.6,5.1,33.3,13.1,2015
4894,401-500,Utah State University,126-146,NaN,13.6,0.0,3.6,10.8,25.1,15.5,2015
4895,401-500,Vienna University of Technology,4-6,NaN,0.0,0.0,0.0,12.2,28.8,22.9,2015
4896,401-500,Wake Forest University,126-146,NaN,0.0,0.0,14.9,7.5,25.0,11.9,2015

In [321]:
cwur = pd.read_csv("/home/vito/Scrivania/Unimib_Texbooks/Foundations_of_Computer_Science/Progetto/2020/cwurData.csv" , na_values = '-')
cwur.tail()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
2195,996,University of the Algarve,Portugal,7,367,567,218,926,845,812,969.0,816,44.03,2015
2196,997,Alexandria University,Egypt,4,236,566,218,997,908,645,981.0,871,44.03,2015
2197,998,Federal University of Ceará,Brazil,18,367,549,218,830,823,812,975.0,824,44.03,2015
2198,999,University of A Coruña,Spain,40,367,567,218,886,974,812,975.0,651,44.02,2015
2199,1000,China Pharmaceutical University,China,83,367,567,218,861,991,812,981.0,547,44.02,2015

In [360]:
mr_shanghai = shanghai[shanghai['year'] >= shanghai['year'].max()].copy()
mr_shanghai.tail()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
4892,401-500,University of Trieste,11-20,NaN,0.0,0.0,5.0,10.9,25.1,20.1,2015
4893,401-500,University of Zaragoza,9-13,NaN,0.0,0.0,7.6,5.1,33.3,13.1,2015
4894,401-500,Utah State University,126-146,NaN,13.6,0.0,3.6,10.8,25.1,15.5,2015
4895,401-500,Vienna University of Technology,4-6,NaN,0.0,0.0,0.0,12.2,28.8,22.9,2015
4896,401-500,Wake Forest University,126-146,NaN,0.0,0.0,14.9,7.5,25.0,11.9,2015

In [361]:
mr_cwur = cwur[cwur['year'] >= cwur['year'].max()].copy()
mr_cwur.tail()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
2195,996,University of the Algarve,Portugal,7,367,567,218,926,845,812,969.0,816,44.03,2015
2196,997,Alexandria University,Egypt,4,236,566,218,997,908,645,981.0,871,44.03,2015
2197,998,Federal University of Ceará,Brazil,18,367,549,218,830,823,812,975.0,824,44.03,2015
2198,999,University of A Coruña,Spain,40,367,567,218,886,974,812,975.0,651,44.02,2015
2199,1000,China Pharmaceutical University,China,83,367,567,218,861,991,812,981.0,547,44.02,2015

In [324]:
#mr_shanghai2 =  shanghai[shanghai['year'] >= shanghai['year'].max()]

In [325]:
#mr_shanghai2[mr_shanghai2['world_rank'].str.contains('-')]['world_rank']

In [326]:
#mr_shanghai2[mr_shanghai2['world_rank'].str.contains('-')]['world_rank'].str.replace('(\d+)-(\d+)',r' \1', regex= True)

In [327]:
#mr_shanghai2.loc[mr_shanghai2['world_rank'].str.contains('-'), 'ranking'] = mr_shanghai2[mr_shanghai2['world_rank'].str.contains('-')]['world_rank'].str.replace('(\d+)-(\d+)',r' \1', regex= True)

In [358]:
extr = most_recent['world_rank'].str.extract(r'(\d+)(\-*)(\d*)')
most_recent['ranking'] = extr[0]
most_recent

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,ranking
1803,1,California Institute of Technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,"2,243",6.9,27%,33 : 67,2016,1
1804,2,University of Oxford,United Kingdom,86.5,94.4,98.9,98.8,73.1,94.2,"19,919",11.6,34%,46 : 54,2016,2
1805,3,Stanford University,United States of America,92.5,76.3,96.2,99.9,63.3,93.9,"15,596",7.8,22%,42 : 58,2016,3
1806,4,University of Cambridge,United Kingdom,88.2,91.5,96.7,97.0,55.0,92.8,"18,812",11.8,34%,46 : 54,2016,4
1807,5,Massachusetts Institute of Technology,United States of America,89.4,84.0,88.6,99.7,95.4,92.0,"11,074",9.0,33%,37 : 63,2016,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2598,601-800,Yeungnam University,South Korea,18.6,24.3,10.9,26.5,35.4,NaN,"21,958",15.3,3%,48 : 52,2016,601
2599,601-800,Yıldız Technical University,Turkey,14.5,14.9,7.6,19.3,44.0,NaN,"31,268",28.7,2%,36 : 64,2016,601
2600,601-800,Yokohama City University,Japan,24.0,16.1,10.2,36.4,37.9,NaN,"4,122",3.7,3%,NaN,2016,601
2601,601-800,Yokohama National University,Japan,20.1,23.3,16.0,13.5,40.4,NaN,"10,117",12.1,8%,28 : 72,2016,601
2602,601-800,Yuan Ze University,Taiwan,16.2,17.7,18.3,28.6,39.8,NaN,"8,663",20.6,4%,43 : 57,2016,601

In [362]:
extr2 = mr_shanghai['world_rank'].str.extract(r'(\d+)(\-*)(\d*)')
mr_shanghai['ranking'] = extr2[0]
mr_shanghai

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,ranking
4397,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,76.6,2015,1
4398,2,Stanford University,2,73.3,40.7,89.6,80.1,70.1,70.6,53.8,2015,2
4399,3,Massachusetts Institute of Technology (MIT),3,70.4,68.2,80.7,60.6,73.1,61.1,68.0,2015,3
4400,4,"University of California, Berkeley",4,69.6,65.1,79.4,66.1,65.6,67.9,56.5,2015,4
4401,5,University of Cambridge,1,68.8,77.1,96.6,50.8,55.6,66.4,55.8,2015,5
...,...,...,...,...,...,...,...,...,...,...,...,...
4892,401-500,University of Trieste,11-20,NaN,0.0,0.0,5.0,10.9,25.1,20.1,2015,401
4893,401-500,University of Zaragoza,9-13,NaN,0.0,0.0,7.6,5.1,33.3,13.1,2015,401
4894,401-500,Utah State University,126-146,NaN,13.6,0.0,3.6,10.8,25.1,15.5,2015,401
4895,401-500,Vienna University of Technology,4-6,NaN,0.0,0.0,0.0,12.2,28.8,22.9,2015,401
4896,401-500,Wake Forest University,126-146,NaN,0.0,0.0,14.9,7.5,25.0,11.9,2015,401

In [399]:
rank = pd.merge(most_recent[['university_name','ranking']], mr_shanghai[['ranking','university_name']], on ='university_name', suffixes=('_times','_shanghai')  )   
rank = pd.merge(rank, mr_cwur[['world_rank','institution']], left_on ='university_name', right_on='institution', suffixes=('','_cwur')  ) 
rank.drop('institution',axis=1, inplace = True)

In [400]:
rank.rename(columns = {'world_rank' : 'ranking_cwur'}, inplace = True)

In [391]:
rank['max_diff'] = rank[['ranking_times','ranking_shanghai', 'ranking_cwur']].astype(int).max(axis=1) - rank[['ranking_times','ranking_shanghai', 'ranking_cwur']].astype(int).min(axis=1)
rank

,university_name,ranking_times,ranking_shanghai,ranking_cwur,max_diff
0,California Institute of Technology,1,7,12,11
1,University of Oxford,2,10,5,8
2,Stanford University,3,2,2,1
3,University of Cambridge,4,5,4,1
4,Harvard University,6,1,1,5
...,...,...,...,...,...
292,Okayama University,601,401,245,356
293,Polytechnic University of Valencia,601,301,440,300
294,Sichuan University,601,301,479,300
295,University of Szeged,601,401,731,330
296,University of Tehran,601,201,768,567

In [401]:
rank.max(axis = 1, numeric_only = True) -rank.min(axis = 1, numeric_only = True)

0      0
1      0
2      0
3      0
4      0
      ..
292    0
293    0
294    0
295    0
296    0
Length: 297, dtype: int64

In [333]:
rank[rank['university_name'] == 'Aarhus University']    #check come da traccia

      university_name ranking_times ranking_shanghai  ranking_cwur  max_diff
65  Aarhus University           106               73           122        49

## 5. Consider only the most recent data point of the times dataset. Compute the number of male and female students for each country.¶

In [364]:
mr_times = most_recent.dropna(subset= ['female_male_ratio', 'num_students']).copy()
mr_times.tail()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,ranking
2597,601-800,Xidian University,China,17.9,12.8,12.1,8.9,83.7,NaN,"31,618",16.4,2%,29 : 71,2016,601
2598,601-800,Yeungnam University,South Korea,18.6,24.3,10.9,26.5,35.4,NaN,"21,958",15.3,3%,48 : 52,2016,601
2599,601-800,Yıldız Technical University,Turkey,14.5,14.9,7.6,19.3,44.0,NaN,"31,268",28.7,2%,36 : 64,2016,601
2601,601-800,Yokohama National University,Japan,20.1,23.3,16.0,13.5,40.4,NaN,"10,117",12.1,8%,28 : 72,2016,601
2602,601-800,Yuan Ze University,Taiwan,16.2,17.7,18.3,28.6,39.8,NaN,"8,663",20.6,4%,43 : 57,2016,601

In [365]:
appoggio = mr_times['female_male_ratio'].str.extract(r'(\d+) : (\d+)')
mr_times['females'] = mr_times['num_students'].str.replace(',','').astype(int)*appoggio[0].astype(int)//(appoggio[0].astype(int)+appoggio[1].astype(int))
mr_times.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,ranking,females
1803,1,California Institute of Technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,"2,243",6.9,27%,33 : 67,2016,1,740
1804,2,University of Oxford,United Kingdom,86.5,94.4,98.9,98.8,73.1,94.2,"19,919",11.6,34%,46 : 54,2016,2,9162
1805,3,Stanford University,United States of America,92.5,76.3,96.2,99.9,63.3,93.9,"15,596",7.8,22%,42 : 58,2016,3,6550
1806,4,University of Cambridge,United Kingdom,88.2,91.5,96.7,97.0,55.0,92.8,"18,812",11.8,34%,46 : 54,2016,4,8653
1807,5,Massachusetts Institute of Technology,United States of America,89.4,84.0,88.6,99.7,95.4,92.0,"11,074",9.0,33%,37 : 63,2016,5,4097

In [366]:
mr_times['males'] = mr_times['num_students'].str.replace(',','').astype(int)*appoggio[1].astype(int)//(appoggio[1].astype(int)+appoggio[0].astype(int))
mr_times

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,ranking,females,males
1803,1,California Institute of Technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,"2,243",6.9,27%,33 : 67,2016,1,740,1502
1804,2,University of Oxford,United Kingdom,86.5,94.4,98.9,98.8,73.1,94.2,"19,919",11.6,34%,46 : 54,2016,2,9162,10756
1805,3,Stanford University,United States of America,92.5,76.3,96.2,99.9,63.3,93.9,"15,596",7.8,22%,42 : 58,2016,3,6550,9045
1806,4,University of Cambridge,United Kingdom,88.2,91.5,96.7,97.0,55.0,92.8,"18,812",11.8,34%,46 : 54,2016,4,8653,10158
1807,5,Massachusetts Institute of Technology,United States of America,89.4,84.0,88.6,99.7,95.4,92.0,"11,074",9.0,33%,37 : 63,2016,5,4097,6976
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2597,601-800,Xidian University,China,17.9,12.8,12.1,8.9,83.7,NaN,"31,618",16.4,2%,29 : 71,2016,601,9169,22448
2598,601-800,Yeungnam University,South Korea,18.6,24.3,10.9,26.5,35.4,NaN,"21,958",15.3,3%,48 : 52,2016,601,10539,11418
2599,601-800,Yıldız Technical University,Turkey,14.5,14.9,7.6,19.3,44.0,NaN,"31,268",28.7,2%,36 : 64,2016,601,11256,20011
2601,601-800,Yokohama National University,Japan,20.1,23.3,16.0,13.5,40.4,NaN,"10,117",12.1,8%,28 : 72,2016,601,2832,7284
2602,601-800,Yuan Ze University,Taiwan,16.2,17.7,18.3,28.6,39.8,NaN,"8,663",20.6,4%,43 : 57,2016,601,3725,4937

In [337]:
mr_times.groupby('country')[['country', 'females', 'males']].sum()

                          females    males
country
Argentina                   67191    41181
Australia                  391722   321624
Austria                     68362    66109
Bangladesh                  21323    41392
Belarus                     20219     9083
...                           ...      ...
Uganda                      18670    18670
Ukraine                     17845    19249
United Arab Emirates         9515     4930
United Kingdom             711775   612993
United States of America  1597354  1553207

[70 rows x 2 columns]

## 6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities)

In [370]:
mr_times['ratio'] = mr_times['females']/mr_times['males']
mr_times.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,ranking,females,males,ratio
1803,1,California Institute of Technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,"2,243",6.9,27%,33 : 67,2016,1,740,1502,0.492676
1804,2,University of Oxford,United Kingdom,86.5,94.4,98.9,98.8,73.1,94.2,"19,919",11.6,34%,46 : 54,2016,2,9162,10756,0.851804
1805,3,Stanford University,United States of America,92.5,76.3,96.2,99.9,63.3,93.9,"15,596",7.8,22%,42 : 58,2016,3,6550,9045,0.724157
1806,4,University of Cambridge,United Kingdom,88.2,91.5,96.7,97.0,55.0,92.8,"18,812",11.8,34%,46 : 54,2016,4,8653,10158,0.851841
1807,5,Massachusetts Institute of Technology,United States of America,89.4,84.0,88.6,99.7,95.4,92.0,"11,074",9.0,33%,37 : 63,2016,5,4097,6976,0.587299

In [412]:
mr_times['ratio'].astype(np.float32).mean()

inf